#include "Geometory.h"

void Geometory::MakeBox()
{
	// 元データの作成
	Vertex vtx[] = {
		// -Z面
		{ {-0.5f,  0.5f, -0.5f}, {0.0f, 0.0f} },
		{ { 0.5f,  0.5f, -0.5f}, {1.0f, 0.0f} },
		{ {-0.5f, -0.5f, -0.5f}, {0.0f, 1.0f} },
		{ { 0.5f, -0.5f, -0.5f}, {1.0f, 1.0f} },

		// -Y面
		{ {-0.5f, -0.5f, -0.5f}, {0.0f, 0.0f} },
		{ { 0.5f, -0.5f, -0.5f}, {1.0f, 0.0f} },
		{ {-0.5f, -0.5f,  0.5f}, {0.0f, 1.0f} },
		{ { 0.5f, -0.5f,  0.5f}, {1.0f, 1.0f} },

		// -X面
		{ {-0.5f,  0.5f,  0.5f}, {0.0f, 0.0f} },
		{ {-0.5f,  0.5f, -0.5f}, {1.0f, 0.0f} },
		{ {-0.5f, -0.5f,  0.5f}, {0.0f, 1.0f} },
		{ {-0.5f, -0.5f, -0.5f}, {1.0f, 1.0f} },

		// +Z面
		{ { 0.5f,  0.5f,  0.5f}, {0.0f, 0.0f} },
		{ {-0.5f,  0.5f,  0.5f}, {1.0f, 0.0f} },
		{ { 0.5f, -0.5f,  0.5f}, {0.0f, 1.0f} },
		{ {-0.5f, -0.5f,  0.5f}, {1.0f, 1.0f} },

		// +Y面
		{ {-0.5f,  0.5f,  0.5f}, {0.0f, 0.0f} },
		{ { 0.5f,  0.5f,  0.5f}, {1.0f, 0.0f} },
		{ {-0.5f,  0.5f, -0.5f}, {0.0f, 1.0f} },
		{ { 0.5f,  0.5f, -0.5f}, {1.0f, 1.0f} },

		// +X面
		{ { 0.5f,  0.5f, -0.5f}, {0.0f, 0.0f} },
		{ { 0.5f,  0.5f,  0.5f}, {1.0f, 0.0f} },
		{ { 0.5f, -0.5f, -0.5f}, {0.0f, 1.0f} },
		{ { 0.5f, -0.5f,  0.5f}, {1.0f, 1.0f} },
	};

	int idx[] = {
		 0,  1,  2,   1,  3,  2,	// -Z面
		 4,  5,  6,   5,  7,  6,	// -Y面
		 8,  9, 10,   9, 11, 10,	// -X面
		12, 13, 14,  13, 15, 14,	// +Z面
		16, 17, 18,  17, 19, 18,	// +Y面
		20, 21, 22,  21, 23, 22,	// +X面
		
	};

	// バッファの作成
	MeshBuffer::Description desc = {};
	desc.pVtx		= vtx;
	desc.vtxCount	= _countof(vtx);	// 頂点の数  sizeof(vtx) / sizeof(vtx[0]) 24
	desc.vtxSize	= sizeof(Vertex);	// 頂点一つあたりのデータサイズを調べる 20
	desc.pIdx		= idx;	
	desc.idxCount	= _countof(idx);	// インデックスの数
	desc.idxSize	= sizeof(int);		// インデックス一つあたりのデータサイズ 4
	desc.topology	= D3D10_PRIMITIVE_TOPOLOGY_TRIANGLELIST;	// 立方体を表示するためのプリミティブ
	m_pBox			= new MeshBuffer(desc);
}

void Geometory::MakeCylinder()
{
	//--- 頂点の作成
	// 天面、底面

	// 側面

	//--- インデックスの作成
	// 天面、底面

	// 側面


	//--- バッファの作成
}

void Geometory::MakeSphere()
{
	//--- 頂点の作成

	//--- インデックスの作成

	// バッファの作成
}